20220112174537-orbital_mcmc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-24 Wed 03:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orbital MCMC</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Orbital MCMC</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20220306194751-markov_chain_monte_carlo_new.html#ID-5acc4f0f-417e-424f-95a5-1c95e7e822ff">Markov Chain Monte Carlo</a></dd>
</dl>


<p>
Most MCMC algorithms follow the same procedure<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>:
</p>
<ul class="org-ul">
<li>Use a transformation to generate a proposal</li>
<li>Use a RMH acceptance test</li>
</ul>

<p>
The design of a transfomation is constrained by the fact that it must leave the underlying measure invariant. The <a href="20211202111457-involutive_mcmc_a_unifying_framework.html#ID-fc3d3ba4-905f-4bf4-aaf0-b84ccac5b248">Involutive MCMC</a> framework shows that many existing algorithms can be understood as involutions embedded in stochastic transition kernels. This paper extends this work and derives kernels that do not rely on involutions.
</p>

<p>
Given a deterministic map \(f\) we try to buil the kernel \(k\) that admits the target density as its eigenfunction. First we need to derive the acceptance test.
</p>

<p>
\[
\operatorname{orb}(x_0) = \left\{f^k(x_0), k \in \mathbb{Z} \right\}
\]
</p>

<p>
Arrive at the conclusion that \(f\) must preserve the measure \(q(x)p(x)\) on \(\operatorname{orb}(x_0)\).
</p>

<div id="outline-container-orgaf3b86e" class="outline-2">
<h2 id="orgaf3b86e">Periodic Orbital MCMC</h2>
<div class="outline-text-2" id="text-orgaf3b86e">
<p>
Starting from the initial state \(x_0\) we would like to traverse \(\operatorname{orb}(x_0)\) and accept \(\{f^k(x_0), k\in\mathbb{Z}\}\) with the weights \(\omega_k\) associated with them.
</p>

<p>
<i>direction</i> decides how we apply \(f\) to the current state \(x_0\).
</p>
</div>
</div>

<div id="outline-container-orgd538f68" class="outline-2">
<h2 id="orgd538f68">Contracting Orbital MCMC</h2>
</div>
<div id="outline-container-orgce92280" class="outline-2">
<h2 id="orgce92280">Using Hamiltonian dynamics</h2>
<div class="outline-text-2" id="text-orgce92280">
<p>
Choice of deterministic function \(f\):
</p>
<ul class="org-ul">
<li><i>periodic Orbital MCMC:</i> Leapfrog integrator</li>
<li><i>contracting Orbital MCMC:</i> Leapfrog integrator with a friction component.</li>
</ul>

<p>
<i>In this case, can it be interpreted as another way (like recycled HMC) to get more samplers out of Hamiltonian trajectories? In this case aren't HMC and recycled HMC particular cases of orbital HMC?</i>
</p>
</div>

<div id="outline-container-org65ba36c" class="outline-3">
<h3 id="org65ba36c"><span class="todo TODO">TODO</span> Show accepted proposals with HMC, recycled HMC, Perpetual HMC, Orbital HMC</h3>
</div>
</div>

<div id="outline-container-orgbed2be1" class="outline-2">
<h2 id="orgbed2be1">In practice</h2>
<div class="outline-text-2" id="text-orgbed2be1">
</div>
</div>

<div id="outline-container-orgf65b990" class="outline-2">
<h2 id="orgf65b990">Links to this note</h2>
<div class="outline-text-2" id="text-orgf65b990">
<ul class="org-ul">
<li><a href="./20211202111457-involutive_mcmc_a_unifying_framework.html">Involutive MCMC</a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="20220407104801-hmc.html#ID-3721cf12-9b6a-4c97-845f-fd285e96913a">HMC</a>, for instance, augments the state-space with an additional variable (the <i>momentum</i>) and then integrates the Hamiltonian equations to generate a new proposal point.
</p></div></div>


</div>
</div></div>
</body>
</html>
